src/Documents/ЧекКоррекции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ЧекКоррекции</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АвторДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаКоррекции</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументРасчетов</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Реализация</v8:Type>
						<v8:Type>cfg:DocumentRef.ВводНачальныхОстатков</v8:Type>
						<v8:Type>cfg:DocumentRef.ЧекКоррекции</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеДенежныхСредств</v8:Type>
						<v8:Type>cfg:DocumentRef.СписаниеДенежныхСредств</v8:Type>
						<v8:Type>cfg:DocumentRef.Прием</v8:Type>
						<v8:Type>cfg:DocumentRef.НарядЗаказ</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратОтПокупателя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительныйРеквизит</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Касса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Кассир</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КассирИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КассоваяСмена</Name>
					<Comment>Кассовая смена</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.КассоваяСмена</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеприменениеККТ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПредписания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСмены</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерЧекаККМ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеКоррекции</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Покупатель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПокупательEmail</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПокупательИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПокупательНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПризнакАгента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПробитЧек</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СистемаНалогообложения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыСистемНалогообложенияККТ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаВключаетНДС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипКоррекции</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипРасчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыРасчетаДенежнымиСредствами</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоСторно</Name>
					<Comment>Признак сторнирующего документа</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Оплата</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипОплаты</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыОплатыККТ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПозицииЧека</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДанныеПоставщикаИНН</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДанныеПоставщикаНаименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДанныеПоставщикаТелефон</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаименованиеПредметаРасчета</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>256</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерСекции</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПризнакАгентаПоПредметуРасчета</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>11</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПризнакПредметаРасчета</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ПризнакиПредметаРасчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПризнакСпособаРасчета</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ПризнакиСпособаРасчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаСкидок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаСоСкидками</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаСоСкидками</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Штрихкод</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТаблицаОснований</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Аванс</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.Прием</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>cfg:DocumentRef.НарядЗаказ</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПлатежа</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументОснование</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.Реализация</v8:Type>
								<v8:Type>cfg:DocumentRef.ВводНачальныхОстатков</v8:Type>
								<v8:Type>cfg:DocumentRef.ЧекКоррекции</v8:Type>
								<v8:Type>cfg:DocumentRef.ПоступлениеДенежныхСредств</v8:Type>
								<v8:Type>cfg:DocumentRef.ПланЛечения</v8:Type>
								<v8:Type>cfg:DocumentRef.СписаниеДенежныхСредств</v8:Type>
								<v8:Type>cfg:DocumentRef.Прием</v8:Type>
								<v8:Type>cfg:DocumentRef.НарядЗаказ</v8:Type>
								<v8:Type>cfg:DocumentRef.ВозвратОтПокупателя</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторФискальнойЗаписи</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПолнаяПостоплата</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаАванса</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/Documents/ЧекКоррекции/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
// Процедура - обработчик события "ПриСозданииНаСервере".
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИспользуетсяКомиссионнаяТорговля = Ложь;
	//ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(Объект.Организация, "ПриемАгентскихПлатежей")
	//	Или Объект.ПозицииЧека.НайтиСтроки(Новый Структура("ПризнакАгентаПоПредметуРасчета", "Комиссионер")).Количество() > 0;
	
	УстановитьВидимостьДоступность();
	
	Если Объект.ПометкаУдаления = Истина Тогда
		Элементы.ГруппаСостояниеОбъекта.Видимость = Истина;	
		РаботаСДиалогами.УстановитьСостояниеОбъекта(ЭтаФорма, Объект.ПометкаУдаления, Объект.Проведен);		
	КонецЕсли;
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	
	УстановитьКартинкуДляКомментария(Элементы.СтраницаКомментарий, Объект.Комментарий);
	ОснованиеНеприменениеККТ 	= Нстр("ru='Неприменение ККТ'");
	ДокументНедоступен			= Нстр("ru='<Документ недоступен>");
	
	ПроверитьДокументыОснованияИРасчетов();   		
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события "ПриОткрытии".
//
Процедура ПриОткрытии(Отказ)
	
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);	
	ОбновитьИтоги();

КонецПроцедуры

&НаСервере
// Процедура - обработчик события "ПриЧтенииНаСервере".
//
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	РаботаСДиалогами.УстановитьСостояниеОбъекта(ЭтаФорма, Объект.ПометкаУдаления, Объект.Проведен);
	
	Если Объект.ПометкаУдаления = Истина Тогда
		Элементы.ГруппаСостояниеОбъекта.Видимость = Истина;	
	Иначе
		Элементы.ГруппаСостояниеОбъекта.Видимость = Ложь;	
	КонецЕсли; 
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	
КонецПроцедуры       

&НаСервере
// Процедура - обработчик события "ПослеЗаписиНаСервере".
//
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

	РаботаСДиалогами.УстановитьСостояниеОбъекта(ЭтаФорма, Объект.ПометкаУдаления, Объект.Проведен);
	УстановитьВидимостьДоступность();

КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события "ПослеЗаписи".
//
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ПараметрыОповещения = Новый Структура;
	ПараметрыОповещения.Вставить("Проведен"	, Объект.Проведен);
	ПараметрыОповещения.Вставить("ПробитЧек", Объект.ПробитЧек);
	
	Оповестить("ЗаписьЧекаКоррекции", ПараметрыОповещения, Объект.Ссылка);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

&НаСервере
// Процедура - устанавливает картинку для комментария.
//
Процедура УстановитьКартинкуДляКомментария(ГруппаДополнительно, Комментарий)
	
	Если ЗначениеЗаполнено(Комментарий) Тогда
		ГруппаДополнительно.Картинка = БиблиотекаКартинок.Комментарий;
	Иначе
		ГруппаДополнительно.Картинка = Новый Картинка;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура "Подключаемый_ОбновитьКоманды".
//
Процедура Подключаемый_ОбновитьКоманды()
	
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	
КонецПроцедуры

&НаСервере
// Процедура устанавливает видимость и доступность элементов.
//
Процедура УстановитьВидимостьДоступность()
	
	Если Объект.ПробитЧек Тогда
		ЭтотОбъект.ТолькоПросмотр = Истина;
		Элементы.ФормаПробитьЧек.Доступность = Ложь;
	ИначеЕсли Объект.ЭтоСторно Тогда
		Элементы.Страницы.ТолькоПросмотр = Истина;
	КонецЕсли;
	
	Элементы.ТипРасчетаНеприменениеККТ.Видимость 			= Объект.НеприменениеККТ;
	Элементы.СтруктурнаяЕдиницаНеприменениеККТ.Видимость	= Объект.НеприменениеККТ;
	Элементы.ОрганизацияНеприменениеККТ.Видимость 			= Объект.НеприменениеККТ;
	Элементы.ОснованиеНеприменениеККТ.Видимость 			= Объект.НеприменениеККТ;
	Элементы.ДатаКоррекцииНеприменениеККТ.Видимость 		= Объект.НеприменениеККТ;
	Элементы.НомерПредписания.Видимость 					= Объект.ТипКоррекции = 1;
	
	//Элементы.ЭтоСторно.Видимость							= Не Объект.НеприменениеККТ;
	Элементы.НередактируемыеДанныеЛево.Видимость			= Не Объект.НеприменениеККТ;
	Элементы.ТаблицаОснований.Видимость						= Не Объект.НеприменениеККТ;
	
	Элементы.НередактируемыеДанныеПраво.Видимость			= Не Объект.НеприменениеККТ;
	
	Элементы.ГруппаБлокировкаДокумента.Видимость			= ЗначениеЗаполнено(Объект.НомерЧекаККМ);
	
	Элементы.ПокупательИНННеприменениеККТ.Видимость			= Объект.НеприменениеККТ;
	Элементы.ПокупательНеприменениеККТ.Видимость			= Объект.НеприменениеККТ;
	
	Элементы.ПокупательИНН.Видимость						= Не Объект.НеприменениеККТ;
	Элементы.Покупатель.Видимость							= Не Объект.НеприменениеККТ;
		
	Элементы.ОписаниеКоррекции.Видимость					= Не Объект.НеприменениеККТ;
	Элементы.ОписаниеКоррекцииНеПрименениеККТ.Видимость		= Объект.НеприменениеККТ;

	Элементы.ТипКоррекции.МаксимальнаяШирина				= ?(Объект.ТипКоррекции = 0	, 45, 20);
	Элементы.ДекорацияЗаголовокКассоваяСмена.Ширина			= ?(Объект.НеприменениеККТ	, 16, 18);
	Элементы.ДекорацияЗаголовокНомерЧека.Ширина				= ?(Объект.НеприменениеККТ	, 16, 18);
	
КонецПроцедуры

&НаСервере
// Процедура проверяет документы основания и расчетов.
//
Процедура ПроверитьДокументыОснованияИРасчетов()
	
	Если НЕ Объект.НеприменениеККТ Тогда
		
		//ДокументОснованиеДоступно 						= ДокументДоступен(Объект.ДокументОснование);
		//Элементы.ДокументОснование.Видимость 			= ДокументОснованиеДоступно;
		//Элементы.ДокументОснованиеНедоступен.Видимость 	= НЕ ДокументОснованиеДоступно;
		
		ДокументРасчетовДоступно 						= ДокументДоступен(Объект.ДокументРасчетов);
		Элементы.ДокументРасчетов.Видимость 			= ДокументРасчетовДоступно;
		Элементы.ДокументРасчетовНедоступен.Видимость 	= НЕ ДокументРасчетовДоступно;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Процедура проверяет доступность документа.
//
Функция ДокументДоступен(Документ)
	
	Если Не Документ = Неопределено И Не Документ.Пустая() Тогда
		Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Документ, "Ссылка") = Неопределено Тогда
			Возврат Ложь
		КонецЕсли;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

&НаКлиенте
// Процедура Устанавливает картинку для комменатария.
//
Процедура Подключаемый_УстановитьКартинкуДляКомментария()
	
	УстановитьКартинкуДляКомментария(Элементы.СтраницаКомментарий, Объект.Комментарий);
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик оповещение "ПробитьЧекВыполнитьЗавершение".
//
Процедура ПробитьЧекВыполнитьЗавершение(РезультатВыполнения, Параметры) Экспорт
	
	ЭтотОбъект.Доступность = Истина;
	
	Если РезультатВыполнения.Результат Тогда
		
		Объект.НомерСмены = РезультатВыполнения.ВыходныеПараметры[0];
		Если ЗначениеЗаполнено(РезультатВыполнения.ВыходныеПараметры[1]) Тогда
			Объект.НомерЧекаККМ = РезультатВыполнения.ВыходныеПараметры[1];
		КонецЕсли;
		
		Объект.ПробитЧек = Истина;
		ЭтотОбъект.Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Запись));
		ЭтотОбъект.ТолькоПросмотр = Истина;
		Элементы.ФормаПробитьЧек.Доступность = Ложь;
		
	Иначе
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'При печати чека произошла ошибка:'") + Символы.ПС + РезультатВыполнения.ОписаниеОшибки);
		
	КонецЕсли;
	
КонецПроцедуры


#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
// Процедура - обработчик события "ПриИзменении".
//    
Процедура ПокупательПриИзменении(Элемент)
	
	Если ТипЗнч(Объект.Покупатель) <> Тип("Строка") И ЗначениеЗаполнено(Объект.Покупатель) Тогда
		Объект.ПокупательИНН = ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(Объект.Покупатель, "ИНН");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события "ПриИзменении".
//    
Процедура ТипКоррекцииПриИзменении(Элемент)
	
	УстановитьВидимостьДоступность();

КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события "ПриИзменении".
//
Процедура ОтветственныйПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.Ответственный) Тогда
		
		РеквизитыКассира = ОбщегоНазначенияСтоматология.ПолучитьЗначенияРеквизитов(Объект.АвторДокумента,  Новый Структура("Наименование, ИНН"));
		
		Объект.Кассир 		= РеквизитыКассира.Наименование;
		Объект.КассирИНН 	= РеквизитыКассира.ИНН;
		
	Иначе
		
		Объект.Кассир 		= "";
		Объект.КассирИНН 	= "";
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПозицииЧека

&НаКлиенте
// Процедура - обработчик события "ПриИзменении".
//
Процедура ПозицииЧекаКоличествоПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.ПозицииЧека.ТекущиеДанные;
	Если ТекущаяСтрока <> Неопределено Тогда
		ПересчитатьСуммуСтроки(ТекущаяСтрока);
		ПересчитатьСуммуНДССтроки(ТекущаяСтрока);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события "ПриИзменении".
//
Процедура ПозицииЧекаЦенаСоСкидкамиПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.ПозицииЧека.ТекущиеДанные;
	Если ТекущаяСтрока <> Неопределено Тогда
		ПересчитатьСуммуСтроки(ТекущаяСтрока);
		ПересчитатьСуммуНДССтроки(ТекущаяСтрока);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события "ПриИзменении".
//
Процедура ПозицииЧекаСуммаСоСкидкамиПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.ПозицииЧека.ТекущиеДанные;
	Если ТекущаяСтрока <> Неопределено Тогда
		ТекущаяСтрока.ЦенаСоСкидками = ?(ТекущаяСтрока.Количество = 0, ТекущаяСтрока.СуммаСоСкидками, ТекущаяСтрока.СуммаСоСкидками / ТекущаяСтрока.Количество);
		ПересчитатьСуммуНДССтроки(ТекущаяСтрока);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура обработчик события "ПриИзменении".
//
Процедура ПозицииЧекаСтавкаНДСПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.ПозицииЧека.ТекущиеДанные;
	Если ТекущаяСтрока <> Неопределено Тогда
		ПересчитатьСуммуНДССтроки(ТекущаяСтрока);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
// Процедура - обработчик команды "Пробить чек".
//
Процедура ПробитьЧек(Команда)
	
	Если НЕ ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	ТекстОшибки = "";
	
	Если Объект.ПометкаУдаления Тогда
		ТекстОшибки = НСтр("ru = 'Документ помечен на удаление'");
	ИначеЕсли Объект.Проведен Тогда
		Если Модифицированность Тогда
			ТекстОшибки = НСтр("ru = 'Измененный документ не сохранен'");
		КонецЕсли;
	Иначе
		ТекстОшибки = НСтр("ru = 'Документ не проведен'");
	КонецЕсли;
	
	Если НЕ ПустаяСтрока(ТекстОшибки) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.НомерЧекаККМ) Тогда
		ПоказатьПредупреждение(, НСтр("ru='Документ уже пробит на фискальном регистраторе! Номер чека:';en='Document already stamped on the fiscal registrar! Room check:'") + Объект.НомерЧекаККМ);
		Возврат;
	КонецЕсли;
			
	// Выполнить контроль кассовой смены
	ОписаниеОшибки					= Неопределено;
	ВыполнятьОперациюНаФискальнике  = ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(Объект.Касса, "ИспользоватьБезПодключенияОборудования") = Ложь; 
	ПараметрыИспользованияКассовойСмены = Новый Структура("ВыполнятьОперациюНаФискальнике", ВыполнятьОперациюНаФискальнике);
	РозничныеПродажиКлиент.ВыполнитьКонтрольИспользованияКассовойСмены(ЭтотОбъект, Объект.Касса, ПараметрыИспользованияКассовойСмены, ОписаниеОшибки);

	//
КонецПроцедуры

&НаКлиенте
// Процедура - После контроля использования кассовой смены.
//
// Параметры:
//  ИспользованиеКассовойСменыРазрешено	 - 	 - 
//  ПараметрыИспользованияКассовойСмены	 - 	 - 
//  ОписаниеОшибки						 - 	 - 
//
Процедура ПослеКонтроляИспользованияКассовойСмены(ИспользованиеКассовойСменыРазрешено, ПараметрыИспользованияКассовойСмены, ОписаниеОшибки) Экспорт 
	
	Если ИспользованиеКассовойСменыРазрешено = Ложь Тогда
		ПоказатьОповещениеПользователя(НСтр("ru = 'Чек коррекции'; en = 'Correction check'"),,НСтр("ru = 'Операция запрещена: '; en = 'Operation is prohibited: '") + ОписаниеОшибки, БиблиотекаКартинок.Предупреждение32, СтатусОповещенияПользователя.Важное); 
		Возврат;
	КонецЕсли;
	
	Если ПараметрыИспользованияКассовойСмены.Свойство("ВыполнятьОперациюНаФискальнике") и ПараметрыИспользованияКассовойСмены.ВыполнятьОперациюНаФискальнике Тогда
		//Если КассаИспользуетсяККТ(Объект.Касса) = Истина Тогда
		//	Если Не ЗначениеЗаполнено(ОписаниеОшибки) Тогда
		//		ПараметрыФормы = Новый Структура("Клиент, Касса", Объект.Контрагент, Объект.Касса);
		//		Оповещение = Новый ОписаниеОповещения("НапечататьЧекЗавершение", ЭтотОбъект);
		//		ОткрытьФорму("Обработка.ПомощникПроведенияОплаты.Форма.ФормаПараметровЧекаККТ", ПараметрыФормы, ЭтаФорма,,,,Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		//		Возврат;
		//	КонецЕсли;
		//КонецЕсли;
		
		ВыполнитьОперациюНаККТ();  		
	КонецЕсли;  	
		
КонецПроцедуры   

&НаКлиенте
// Процедура - обработчик команды "СкрытьДополнительно".
//
Процедура ПоказатьСкрытьДополнительно(Команда)

	Элементы.ГруппаДополнительно.Видимость = НЕ Элементы.ГруппаДополнительно.Видимость;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
// Процедура - выполняет операцию на ККТ.
//
Процедура ВыполнитьОперациюНаККТ()
	
	ЭтотОбъект.Доступность = Ложь;
	ФормированиеЧека  = ПодготовитьДанныеДляПробитияЧека(Объект.Ссылка);
	
	Если ФормированиеЧека.Результат Тогда
		ИдентификаторУстройства = МенеджерОборудованияВызовСервера.ПолучитьИдентификаторФискальногоРегистратораДляКассы(Объект.Касса);
		Если ФормированиеЧека.Свойство("ФискальныйЧек") Тогда     			
			ОбщиеПараметры = ФормированиеЧека.ФискальныйЧек;      
			Оповещение = Новый ОписаниеОповещения("ПробитьЧекВыполнитьЗавершение", ЭтотОбъект);
			Если Объект.НеприменениеККТ Тогда
				МенеджерОборудованияКлиент.НачатьФормированиеЧекаКоррекцииНаФискальномУстройстве(Оповещение, ЭтотОбъект.УникальныйИдентификатор, ОбщиеПараметры, ИдентификаторУстройства);
			Иначе
				МенеджерОборудованияКлиент.НачатьФискализациюЧекаНаФискальномУстройстве(Оповещение, ЭтотОбъект.УникальныйИдентификатор, ОбщиеПараметры, ИдентификаторУстройства);
			КонецЕсли;
			
		КонецЕсли;	
	Иначе
		ОписаниеОшибки = ФормированиеЧека.ОписаниеОшибки;
		ТекстСообщения = НСтр("ru='При пробитии чека коррекции произошла ошибка."
		"Дополнительное описание: %ДополнительноеОписание%';en='An error occurred when the correction receipt was broken. Additional description: %ДополнительноеОписание%'");
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ДополнительноеОписание%", ОписаниеОшибки);			
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		
		ЭтотОбъект.Доступность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Функция получает данные для пробития чека.
//
Функция ПодготовитьДанныеДляПробитияЧека(ЧекКоррекции)
	
	Возврат Документы.ЧекКоррекции.ПодготовитьДанныеДляПробитияЧека(ЧекКоррекции);
	
КонецФункции

&НаКлиенте
// Процедура пересчитывает сумму строки.
//
Процедура ПересчитатьСуммуСтроки(ТекущаяСтрока)
	
	ТекущаяСтрока.СуммаСоСкидками = ТекущаяСтрока.Количество * ТекущаяСтрока.ЦенаСоСкидками;
	
КонецПроцедуры

&НаКлиенте
// Процедура пересчитывает сумму НДС.
//
Процедура ПересчитатьСуммуНДССтроки(ТекущаяСтрока)
	
	ТекущаяСтрока.СуммаНДС = Ценообразование.РассчитатьСуммуНДС(ТекущаяСтрока.ЦенаСоСкидками * ТекущаяСтрока.Количество, ТекущаяСтрока.СтавкаНДС);
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события "ПриНачалеРедактирования".
//
Процедура ОплатаПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
		
	СуммаПродажи = Объект.ПозицииЧека.Итог("СуммаСоСкидками");
	СуммаОплат   = Объект.Оплата.Итог("Сумма");
	
	ТекущаяСтрока = Элементы.Оплата.ТекущиеДанные;
	Если ТекущаяСтрока <> Неопределено Тогда
		ТекущаяСумма  = ТекущаяСтрока.Сумма;
		ОплатаБезТекущейСтроки = СуммаОплат - ТекущаяСумма;
		ОстатокОплаты = СуммаПродажи - ОплатаБезТекущейСтроки;
	КонецЕсли;
	
	Элементы.ОплатаСумма.СписокВыбора.Очистить();
	
	Если ОстатокОплаты > 0 Тогда
		
		Элементы.ОплатаСумма.СписокВыбора.Добавить(ОстатокОплаты, Формат(ОстатокОплаты, "ЧЦ=15; ЧДЦ=2; ЧРД=,; ЧРГ=' '; ЧН=; ЧГ=3,0"));
		
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
// Процедура обработчик события "НачалоВыбора".
//
Процедура ОрганизацияНеприменениеККТНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Отбор = Новый Структура;
	Если ЗначениеЗаполнено(Объект.СтруктурнаяЕдиница) Тогда
		Отбор = Новый Структура("Ссылка", ПолучитьОрганизациюСтруктурнойЕдиницы(Объект.СтруктурнаяЕдиница));
	КонецЕсли;
	
	ОткрытьФорму("Справочник.Организации.ФормаВыбора", Новый Структура("Отбор", Отбор), Элемент); 

КонецПроцедуры

&НаСервереБезКонтекста
// Функция - Получить организацию структурной единицы.
//
// Параметры:
//  СтруктурнаяЕдиница	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьОрганизациюСтруктурнойЕдиницы(СтруктурнаяЕдиница)
	
	Возврат СтруктурнаяЕдиница.Организация;
	
КонецФункции

&НаКлиенте
// Процедура обработчик события "ПриИзменении".
//
Процедура СтруктурнаяЕдиницаНеприменениеККТПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.СтруктурнаяЕдиница) Тогда
		Объект.Организация = ПолучитьОрганизациюСтруктурнойЕдиницы(Объект.СтруктурнаяЕдиница);
	Иначе
		Объект.Организация = Неопределено;
	КонецЕсли;
	
	Объект.Касса = Неопределено;
	
КонецПроцедуры    

&НаКлиенте
// Процедура обновляет итоги.
//
Процедура ОбновитьИтоги()
	
	СуммаДокумента	= Объект.ПозицииЧека.Итог("СуммаСоСкидками");
	СуммаНДС		= Объект.ПозицииЧека.Итог("СуммаНДС");
	СуммаОплаты		= Объект.Оплата.Итог("Сумма");
	
КонецПроцедуры  

&НаКлиенте
// Процедура - обработчик события "ПриИзменении".
//
Процедура ПозицииЧекаПриИзменении(Элемент) 
	
	ОбновитьИтоги();
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события "ПриИзменении".
//     
Процедура ОплатаПриИзменении(Элемент)
	
	ОбновитьИтоги();
	
КонецПроцедуры   

&НаКлиенте
// Процедура - обработчик события "ПриИзменении".
//     
Процедура ОрганизацияНеприменениеККТПриИзменении(Элемент)
	
	Объект.Касса = Неопределено;
	
	//ИспользуетсяКомиссионнаяТорговля = ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(Объект.Организация, "ПриемАгентскихПлатежей")
	//	Или Объект.ПозицииЧека.НайтиСтроки(Новый Структура("ПризнакАгентаПоПредметуРасчета", "Комиссионер")).Количество() > 0;
		
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события "Выбор".
//
Процедура ТаблицаОснованийВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Элемент.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Поле.Имя = "ТаблицаОснованийДокументОснование" И ТипЗнч(Элемент.ТекущиеДанные.ДокументОснование) = Тип("ДокументСсылка.ПоступлениеДенежныхСредств") Тогда
		ОткрытьФорму("Документ.ПоступлениеДенежныхСредств.ФормаОбъекта", Новый Структура("Ключ", Элемент.ТекущиеДанные.ДокументОснование));
	ИначеЕсли Поле.Имя = "ТаблицаОснованийДокументОснование" И ТипЗнч(Элемент.ТекущиеДанные.ДокументОснование) = Тип("ДокументСсылка.Реализация") Тогда
		ОткрытьФорму("Документ.Реализация.ФормаОбъекта", Новый Структура("Ключ", Элемент.ТекущиеДанные.ДокументОснование));
	ИначеЕсли Поле.Имя = "ТаблицаОснованийДокументОснование" И ТипЗнч(Элемент.ТекущиеДанные.ДокументОснование) = Тип("ДокументСсылка.СписаниеДенежныхСредств") Тогда
		ОткрытьФорму("Документ.СписаниеДенежныхСредств.ФормаОбъекта", Новый Структура("Ключ", Элемент.ТекущиеДанные.ДокументОснование));
	ИначеЕсли Поле.Имя = "ТаблицаОснованийДокументОснование" И ТипЗнч(Элемент.ТекущиеДанные.ДокументОснование) = Тип("ДокументСсылка.ВозвратОтПокупателя") Тогда
		ОткрытьФорму("Документ.ВозвратОтПокупателя.ФормаОбъекта", Новый Структура("Ключ", Элемент.ТекущиеДанные.ДокументОснование));
	ИначеЕсли Поле.Имя = "ТаблицаОснованийДокументОснование" И ТипЗнч(Элемент.ТекущиеДанные.ДокументОснование) = Тип("ДокументСсылка.ВводНачальныхОстатков") Тогда
		ОткрытьФорму("Документ.ВводНачальныхОстатков.ФормаОбъекта", Новый Структура("Ключ", Элемент.ТекущиеДанные.ДокументОснование));
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти
